[
  {
    "idiom": "Bite off more than you can chew",
    "meaning": "To try to do more than you can manage.",
    "example": "By agreeing to do two big projects at once, I bit off more than I could chew."
  },
  {
    "idiom": "Beat around the bush",
    "meaning": "To avoid talking about what’s important.",
    "example": "Please stop beating around the bush and tell me what happened."
  },
  {
    "idiom": "Cry over spilled milk",
    "meaning": "To be upset about something that has already happened and can’t be changed.",
    "example": "Don’t cry over spilled milk; let’s focus on fixing the problem."
  },
  {
    "idiom": "Get your act together",
    "meaning": "To organise yourself and improve your behaviour.",
    "example": "You need to get your act together if you want to pass this class."
  },
  {
    "idiom": "Kill two birds with one stone",
    "meaning": "To solve two problems with one action.",
    "example": "By walking to work, I kill two birds with one stone: I save money and get exercise."
  },
  {
    "idiom": "Let the cat out of the bag",
    "meaning": "To reveal a secret by mistake.",
    "example": "I let the cat out of the bag about the surprise party when I asked her what cake she likes."
  },
  {
    "idiom": "Pull someone’s leg",
    "meaning": "To joke with someone by telling them something that isn’t true.",
    "example": "Don’t worry, I’m just pulling your leg; I didn’t really sell your bike."
  },
  {
    "idiom": "Burn the midnight oil",
    "meaning": "To work late into the night.",
    "example": "I’ve been burning the midnight oil to finish this project before the deadline."
  },
  {
    "idiom": "Bite the bullet",
    "meaning": "To do something difficult or unpleasant that you have been avoiding.",
    "example": "I finally bit the bullet and went to the dentist after waiting for months."
  },
  {
    "idiom": "Break a leg",
    "meaning": "A way of wishing someone good luck, especially before a performance.",
    "example": "You’re going to do great in the play tonight. Break a leg!"
  },
  {
    "idiom": "Call it a day",
    "meaning": "To stop working on something.",
    "example": "We’ve done a lot of work on the report. Let’s call it a day and continue tomorrow."
  },
  {
    "idiom": "Steal someone’s thunder",
    "meaning": "To take attention away from someone else’s achievement.",
    "example": "I was about to share my good news, but my sister stole my thunder by announcing her engagement."
  },
  {
    "idiom": "The ball is in your court",
    "meaning": "It’s your turn to take action or make a decision.",
    "example": "I’ve made my offer; now the ball is in your court to decide."
  },
  {
    "idiom": "Throw in the towel",
    "meaning": "To give up.",
    "example": "After trying for hours to fix the computer, I threw in the towel and called an expert."
  },
  {
    "idiom": "Under the weather",
    "meaning": "Feeling slightly ill.",
    "example": "I’m feeling a bit under the weather today; I might stay home and rest."
  },
  {
    "idiom": "Speak of the devil",
    "meaning": "Said when someone appears just as you’re talking about them.",
    "example": "Speak of the devil! We were just talking about you when you walked in."
  },
  {
    "idiom": "Once in a blue moon",
    "meaning": "Very rarely.",
    "example": "I only eat fast food once in a blue moon; I usually cook at home."
  },
  {
    "idiom": "Catch someone red-handed",
    "meaning": "To catch someone while they are doing something wrong.",
    "example": "The teacher caught the student red-handed trying to cheat on the test."
  },
  {
    "idiom": "Barking up the wrong tree",
    "meaning": "To look for something in the wrong place or to blame the wrong person.",
    "example": "If you think I took your book, you’re barking up the wrong tree. I haven’t seen it."
  },
  {
    "idiom": "Jump on the bandwagon",
    "meaning": "To join an activity that has become popular.",
    "example": "When healthy eating became popular, many people jumped on the bandwagon."
  },
  {
    "idiom": "Like two peas in a pod",
    "meaning": "Very similar or close.",
    "example": "Those best friends are like two peas in a pod; they do everything together."
  },
  {
    "idiom": "Ten a penny",
    "meaning": "Very common and not special or valuable.",
    "example": "Empty promises are ten a penny; I need to see real actions."
  },
  {
    "idiom": "Go the extra mile",
    "meaning": "To make an extra effort.",
    "example": "Our teachers always go the extra mile to help students understand difficult topics."
  },
  {
    "idiom": "Straight from the horse’s mouth",
    "meaning": "Information from the person who knows best.",
    "example": "I heard about the university’s new policy straight from the horse’s mouth – the vice-chancellor told us herself."
  },
  {
    "idiom": "Take with a pinch of salt",
    "meaning": "To not completely believe something.",
    "example": "You should take his stories with a pinch of salt; he often exaggerates."
  },
  {
    "idiom": "Break the ice",
    "meaning": "To start a conversation or make people feel more comfortable.",
    "example": "To break the ice at the party, I said hello to the person next to me."
  },
  {
    "idiom": "Cut corners",
    "meaning": "To do something in the easiest or cheapest way, often badly.",
    "example": "The company cut corners on safety to save money, which caused problems."
  },
  {
    "idiom": "Hit the nail on the head",
    "meaning": "To describe something exactly right.",
    "example": "You’ve hit the nail on the head with your idea about the problem."
  },
  {
    "idiom": "Piece of cake",
    "meaning": "Something very easy to do.",
    "example": "The test was a piece of cake; I finished it very quickly."
  },
  {
    "idiom": "Cost an arm and a leg",
    "meaning": "To be very expensive.",
    "example": "That new phone costs an arm and a leg; I can’t buy it now."
  }
]
